Repository: ViNN280801/Tusur
Catalog: TusurUI/TusurUI/Resources/ErrorMessages.*.resx
Languages: ru

# AllFieldsZero
source: It is not possible to apply a scenario with all zero fields.
ru: Невозможно применить сценарий со всеми нулевыми полями.

# AllTimeFieldsZero
source: It is not possible to apply a scenario with all zero time fields.
ru: Невозможно применить сценарий со всеми нулевыми полями времени.

# CancellationTitle
source: Stages Cancellation
ru: Остановка выполнения

# DirectCountdownStageCancelled
source: Direct countdown stage was forcibly terminated.
ru: Стадия прямого отсчета была завершена принудительно.

# EmptyCOM
source: COM-port is empty.
ru: COM-порт пуст.

# EmptyTimeTextFields
source: All time fields are empty. Enter at least one of them.
ru: Все поля времени пустые. Введите хотя бы одно из них.

# ErrorTitle
source: Error
ru: Ошибка

source: Internal Error:
ru: Внутренняя ошибка:

# InvalidCurrentValue
source: Current value cannot be {0}. Allowed values: ({1}; {2}]
ru: Величина тока не может быть равной {0}. Допустимые значения: ({1}; {2}]

# InvalidFields
source: You have incorrectly filled in the following fields: {0}
ru: Вы неверно заполнили следующие поля: {0}

# InvalidHoursValue
source: Setting hours in the timer cannot be {0} h. Allowed values: [{1}; {2})
ru: Задание часов в таймере не может быть равным {0} ч. Допустимые значения: [{1}; {2})

# InvalidMinutesValue
source: Setting minutes in the timer cannot be {0} min. Allowed values: [{1}; {2})
ru: Задание минут в таймере не может быть равным {0} мин. Допустимые значения: [{1}; {2})

# InvalidSecondsValue
source: Setting seconds in the timer cannot be {0} sec. Allowed values: [{1}; {2})
ru: Задание секунд в таймере не может быть равным {0} с. Допустимые значения: [{1}; {2})

# InvalidTimeTextField
source: Enter the correct time value.
ru: Введите корректное значение времени.

# MissingCurrent
source: Current value
ru: Величина тока

# MissingHours
source: Hours
ru: Часы

# MissingMinutes
source: Minutes
ru: Минуты

# MissingSeconds
source: Seconds
ru: Секунды

# PowerSupplyComPortError
source: Select the COM port for the power supply first
ru: Сначала выберите COM-порт для блока питания.

# PowerSupplyConnectionWarning
source: No connection with the power supply. Check the power supply and RS-432 cable connection.
ru: Отсутствует связь с блоком питания. Проверьте питание на БП и подключение кабеля RS-432.

# ProgressBarNotFound
source: ProgressBar UI element with name '{0}' not found.
ru: Элемент пользовательского интерфейса ProgressBar с именем '{0}' не найден.

# StageCancelled
source: Stage #{0} and the remaining ones were forcibly terminated.
ru: Стадия №{0} и оставшиеся были завершены принудительно.

# StageCancelledDirect
source: Direct countdown stage was forcibly terminated.
ru: Стадия прямого отсчета была завершена принудительно.

# StageCancelledReverse
source: Stage #{0} and the remaining ones were forcibly terminated.
ru: Стадия №{0} и оставшиеся были завершены принудительно.

# StageErrors
source: Stage #{0}: {1}
ru: Стадия №{0}: {1}

# StageSuccessMessage
source: Stage #{0} successfully completed
ru: Стадия №{0} успешно завершена

# StepMotorComPortError
source: Select the COM port for the stepper motor first.
ru: Сначала выберите COM-порт для шагового двигателя.

# SuccessTitle
source: Success
ru: Успех

# SystemWorkingLabel
source: System is working
ru: Система работает

# TextBoxNotFound
source: TextBox UI element with name '{0}' not found.
ru: Элемент пользовательского интерфейса TextBox с именем '{0}' не найден.

# TimerError
source: Stage {0}: {1}
ru: Стадия {0}: {1}

# TimerErrorTitle
source: Timer Error
ru: Ошибка таймера

# TotalTimeExceeded
source: Total time cannot exceed 24 hours per stage.
ru: Общее время не может превышать 24 часа на одну стадию.

# ValidationTitle
source: Field Validation
ru: Проверка полей

# WarningTitle
source: Warning
ru: Предупреждение
